Ran Plan for 2 projects:

1. project: `project-quick-demo` dir: `Terraform/quick_demo` workspace: `default`
1. project: `project-module-demo` dir: `Terraform/module_demo` workspace: `default`

### 1. project: `project-quick-demo` dir: `Terraform/quick_demo` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_network.default will be created
+ resource "google_compute_network" "default" {
+       auto_create_subnetworks                   = false
+       delete_default_routes_on_create           = false
+       gateway_ipv4                              = (known after apply)
+       id                                        = (known after apply)
+       internal_ipv6_range                       = (known after apply)
+       mtu                                       = (known after apply)
+       name                                      = "wade-test-network"
+       network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
+       project                                   = "adept-presence-396401"
+       routing_mode                              = "GLOBAL"
+       self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `project-module-demo` dir: `Terraform/module_demo` workspace: `default`
**Plan Error**
```
running "/atlantis/bin/terraform1.2.9 plan -input=false -refresh -out \"/atlantis/repos/wadexu007/learning_by_doing/7/default/Terraform/module_demo/project-module-demo-default.tfplan\"" in "/atlantis/repos/wadexu007/learning_by_doing/7/default/Terraform/module_demo": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---

